In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("data.csv")
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [3]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [4]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [5]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [10]:
##Handling missing values
df.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [11]:
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [19]:
#Fill default null values with 0
df_filled = df.fillna(0)
df_filled["Sales"]

0     754.0
1     110.0
2     398.0
3     522.0
4     869.0
5     192.0
6     936.0
7     488.0
8     772.0
9     834.0
10    842.0
11      0.0
12    628.0
13    423.0
14    893.0
15    895.0
16    511.0
17    108.0
18    578.0
19    736.0
20    606.0
21    992.0
22    942.0
23    342.0
24    458.0
25    584.0
26    619.0
27    224.0
28    617.0
29    737.0
30    735.0
31    189.0
32    338.0
33      0.0
34    669.0
35      0.0
36    177.0
37      0.0
38    408.0
39    155.0
40    578.0
41    256.0
42    164.0
43    949.0
44    830.0
45    599.0
46    938.0
47    143.0
48    182.0
49    708.0
Name: Sales, dtype: float64

In [22]:
##Filling missing values with mean of value
df["sales_fillNa"] = df["Sales"].fillna(df['Sales'].mean)
df

,Date,Category,Value,Product,Sales,Region,sales_fillNa
0,2023-01-01,A,28.0,Product1,754.0,East,754.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0
5,2023-01-06,B,54.0,Product3,192.0,West,192.0
6,2023-01-07,A,16.0,Product1,936.0,East,936.0
7,2023-01-08,C,89.0,Product1,488.0,West,488.0
8,2023-01-09,C,37.0,Product3,772.0,West,772.0
9,2023-01-10,A,22.0,Product2,834.0,West,834.0
10,2023-01-11,B,7.0,Product1,842.0,North,842.0
11,2023-01-12,B,60.0,Product2,NaN,West,<bound method Series.mean of 0 754.0\n1 ...
12,2023-01-13,A,70.0,Product3,628.0,South,628.0
13,2023-01-14,A,69.0,Product1,423.0,East,423.0
14,2023-01-15,A,47.0,Product2,893.0,West,893.0
15,2023-01-16,C,NaN,Product1,895.0,North,895.0
16,2023-01-17,C,93.0,Product2,511.0,South,511.0
17,2023-01-18,C,NaN,Product1,108.0,West,108.0
18,2023-01-19,A,31.0,Product2,578.0,West,578.0
19,2023-01-20,A,59.0,Product1,736.0,East,736.0
20,2023-01-21,C,82.0,Product3,606.0,South,606.0
21,2023-01-22,C,37.0,Product2,992.0,South,992.0
22,2023-01-23,B,62.0,Product3,942.0,North,942.0
23,2023-01-24,C,92.0,Product2,342.0,West,342.0
24,2023-01-25,A,24.0,Product2,458.0,East,458.0
25,2023-01-26,C,95.0,Product1,584.0,West,584.0
26,2023-01-27,C,71.0,Product2,619.0,North,619.0
27,2023-01-28,C,56.0,Product2,224.0,North,224.0
28,2023-01-29,B,NaN,Product3,617.0,North,617.0
29,2023-01-30,C,51.0,Product2,737.0,South,737.0
30,2023-01-31,B,50.0,Product3,735.0,West,735.0
31,2023-02-01,A,17.0,Product2,189.0,West,189.0
32,2023-02-02,B,63.0,Product3,338.0,South,338.0
33,2023-02-03,C,27.0,Product3,NaN,East,<bound method Series.mean of 0 754.0\n1 ...
34,2023-02-04,C,70.0,Product3,669.0,West,669.0
35,2023-02-05,B,60.0,Product2,NaN,West,<bound method Series.mean of 0 754.0\n1 ...
36,2023-02-06,C,36.0,Product3,177.0,East,177.0
37,2023-02-07,C,2.0,Product1,NaN,North,<bound method Series.mean of 0 754.0\n1 ...
38,2023-02-08,C,94.0,Product1,408.0,South,408.0
39,2023-02-09,A,62.0,Product1,155.0,West,155.0
40,2023-02-10,B,15.0,Product1,578.0,East,578.0
41,2023-02-11,C,97.0,Product1,256.0,East,256.0
42,2023-02-12,A,93.0,Product3,164.0,West,164.0
43,2023-02-13,A,43.0,Product3,949.0,East,949.0
44,2023-02-14,A,96.0,Product3,830.0,East,830.0
45,2023-02-15,B,99.0,Product2,599.0,West,599.0
46,2023-02-16,B,6.0,Product1,938.0,South,938.0
47,2023-02-17,B,69.0,Product3,143.0,West,143.0
48,2023-02-18,C,65.0,Product3,182.0,North,182.0
49,2023-02-19,C,11.0,Product3,708.0,North,708.0

In [24]:
#Renaming columns

df = df.rename(columns={"Date": "Sales Date"})
df.head(3)

   Sales Date Category  Value   Product  Sales Region sales_fillNa
0  2023-01-01        A   28.0  Product1  754.0   East        754.0
1  2023-01-02        B   39.0  Product3  110.0  North        110.0
2  2023-01-03        C   32.0  Product2  398.0   East        398.0

In [29]:
#Change datatype of column
df["Value_change"]= df['Value'].fillna(df["Value"].mean()).astype(int)
df.dtypes

Sales Date       object
Category         object
Value           float64
Product          object
Sales           float64
Region           object
sales_fillNa     object
Value_change      int32
dtype: object

In [31]:
#Applying lambda functions
df['New value'] = df["Value"].apply(lambda x:x*2)
df.head()

,Sales Date,Category,Value,Product,Sales,Region,sales_fillNa,Value_change,New value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52.0

In [34]:
#Data Aggregation and grouping
groupedMean = df.groupby("Product")['Sales'].sum()
print(groupedMean)

Product
Product1    8623.0
Product2    7374.0
Product3    9631.0
Name: Sales, dtype: float64

In [37]:
df.groupby(["Region","Product"])["Sales"].sum()

Region  Product
East    Product1    4205.0
        Product2     856.0
        Product3    1956.0
North   Product1    1737.0
        Product2     843.0
        Product3    3428.0
South   Product1    1346.0
        Product2    2240.0
        Product3    1572.0
West    Product1    1335.0
        Product2    3435.0
        Product3    2675.0
Name: Sales, dtype: float64

In [39]:
#Aggregate multiple functions
grouped_agg= df.groupby(["Region","Product"])["Sales"].agg(["count","mean","median"])
print(grouped_agg)

                 count        mean  median
Region Product
East   Product1      7  600.714286   578.0
       Product2      2  428.000000   428.0
       Product3      3  652.000000   830.0
North  Product1      2  868.500000   868.5
       Product2      2  421.500000   421.5
       Product3      6  571.333333   662.5
South  Product1      2  673.000000   673.0
       Product2      3  746.666667   737.0
       Product3      3  524.000000   606.0
West   Product1      4  333.750000   321.5
       Product2      6  572.500000   588.5
       Product3      6  445.833333   430.5

In [47]:
#Merging and joining dataframes

df1=pd.DataFrame({"Key":["a",'b','c'], 'Value':[1,2,3]})
df2=pd.DataFrame({"Key":["a",'b','d'], 'Value':[5,6,7]})

print(df1)

  Key  Value
0   a      1
1   b      2
2   c      3

In [49]:
#Merge data
pd.merge(df1,df2,on="Key",how = "inner")

  Key  Value_x  Value_y
0   a        1        5
1   b        2        6

In [50]:
pd.merge(df1,df2,on="Key",how = "outer")

  Key  Value_x  Value_y
0   a      1.0      5.0
1   b      2.0      6.0
2   c      3.0      NaN
3   d      NaN      7.0